const uk = {
  name: "Українська",
  errorScreen: {
    title: "Щось пішло не так!",
    friendlySubtitle:
      "Це екран, який ваші користувачі побачать в продакшені, коли станеться помилка. Вам знадобиться налаштувати це повідомлення (розташовано в app/i18n/en.ts) та, можливо, також макет (app/screens/ErrorScreen). Якщо ви хочете це повністю видалити, перевірте компонент <ErrorBoundary> в app/app.tsx.",
    reset: "ПЕРЕЗАВАНТАЖИТИ ДОДАТОК",
  },
  snackBar: {
    ok: "Добре",
    dismiss: "Відхилити",
    sightingsSaved: "Завантажені дані спостережень для останньої збереженої локації!",
    defaultError: "Сталася помилка",
    locationSaved: "Локацію збережено",
    locationExist: "Локація з такою назвою вже існує!",
    openSettingsError: "Не вдається відкрити налаштування!",
    shared: "Успішно поділилися!",
    savedToGallery: "Збережено до галереї",
  },
  permissionsModal: {
    close: "Закрити",
    openSettings: "Відкрити налаштування",
    body: "Для використання цієї функції вам потрібно надати дозвіл на доступ до галереї.",
  },
  permissionsAndroid: {
    title: "Дозвіл на збереження відео",
    message: "Цьому додатку потрібен дозвіл на збереження відео на вашому пристрої.",
    buttonNeutral: "Запитати пізніше",
    buttonNegative: "Скасувати",
    buttonPositive: "Добре",
  },
  thanksModal: {
    body: "Дякуємо, що зв'язались з нами. Ми отримали ваше повідомлення і обробимо ваш запит. Зверніть увагу, що цей додаток не збирає дані користувачів, тому ми не можемо відповісти на всі повідомлення індивідуально.",
    dismiss: "Відхилити",
  },
  privacy: {
    title: "Використання вашого місцезнаходження",
    body: "Ми використовуємо дані місцезнаходження для розрахунку моментів проходження МКС у вашому поточному місці розташування. Будь ласка, надайте дозвіл на доступ до місцезнаходження, щоб увімкнути цю функцію.",
    agree: "ПРИЙМАЮ",
    skip: "ПРОПУСТИТИ",
    policy: "Політика конфіденційності",
  },
  notifications: {
    push: {
      title: "Побачте станцію зараз!",
      subTitle: "Станція проходить над вами у", // eg "МКС проходить над вами у locationName"
    },
    before: {
      titleOne: "Побачте станцію через",
      titleTwo: "хвилин!",
      subTitleOne: "Станція проходить над вами через",
      subTitleTwo: "хвилин у",
    },
  },
  units: {
    minute: "хв",
    kilometer: "км",
    kilogram: "кг",
    month: "місяць",
    metersPerSecond: "м/с",
    time: "T",
  },
  tabNavigator: {
    homeTab: "Головна",
    issViewTab: "Режим AR",
    issNowTab: "Стеження",
    resourcesTab: "Ресурси",
    settingsTab: "Налаштування",
  },
  onboarding: {
    splash: {
      title: "Побачте станцію",
      subTitle: "Погляньте на небо та спостерігайте Міжнародну космічну станцію",
    },
    completeProfile: {
      notification: {
        title: "Налаштування сповіщень",
        label: "Отримувати сповіщення з пуш-повідомленнями",
        tip: "Отримуйте сповіщення, коли космічна станція наближається до вашого місцезнаходження.",
        nextButton: "Далі",
      },
      location: {
        title: "Ваше місцезнаходження",
        subtitle:
          "Будь ласка, дозвольте додатку автоматично визначити ваше місцезнаходження або введіть його самостійно.",
        detectButton: "Визначити моє місцезнаходження",
        orLabel: "або",
        selectLocation: "Введіть ваше місцезнаходження",
        detecting: "Визначення місцезнаходження...",
        doneButton: "Готово",
        serviceAlertTitle: "Служби локації вимкнені",
        serviceAlertBody: "Будь ласка, увімкніть служби локації, щоб продовжити.",
        permissionAlertTitle: "Дозвіл не надано",
        permissionAlertBody:
          "Ми використовуємо дані місцезнаходження для розрахунку моментів проходження МКС у вашому поточному місці розташування. Будь ласка, надайте дозвіл на доступ до місцезнаходження, щоб увімкнути цю функцію.",
      },
    },
  },
  homeScreen: {
    initLoader: {
      message: "Завантаження даних МКС... Це може зайняти деякий час.",
      trajectoryError:
        "Дані про траєкторію МКС в даний момент недоступні через обслуговування серверів. Будь ласка, спробуйте знову пізніше.",
    },
    header: {
      firstTimeHead: "СПИСОК НАСТ. СПОСТЕРЕЖЕНЬ",
      secondTimeHead: "ЗВОРОТНІЙ ВІДЛІК",
      timezone: "Часовий пояс",
    },
    selectLocation: {
      title: "Вибрати локацію",
      inputPlaceholder: "Пошук локації за містом, адресою...",
      current: "Поточна локація",
      saved: "Збережені локації",
      nearby: "Локації поблизу",
      search: "Результати пошуку",
      cta: "Налаштувати сповіщення для цієї локації",
      actionTitle: "Сповіщення",
      refresh: "Оновити",
    },
    selectSightings: {
      title: "Майбутні спостереження",
      sightings: "Спостереження",
      selectMessage: "Оберіть події, для яких ви хочете отримувати сповіщення.",
      switch: "Повідомляйте мене про всі майбутні події для цієї локації.",
      aboveHorizon: "Над горизонтом",
      today: "Сьогодні",
      tomorrow: "Завтра",
      appears: "Зʼявляється",
      disappears: "Зникає",
      all: "Усі",
      timeOfDay: "Час дня",
      night: "Ніч",
      twilight: "Сутінки",
      duration: "Тривалість",
      shorterThan2: "коротше 2 хвилин",
      longerThan2: "2 хвилини і довше",
      empty: "Немає потенційних спостережень МКС для цієї локації з {{start}} по {{end}}.",
      coach: {
        title: "Пояснення до іконок",
        moon: "Коли МКС буде над горизонтом у обраній локації, там буде ніч.",
        sunset: "Коли МКС буде над горизонтом у обраній локації, там будуть сутінки.",
      },
      compass: {
        N: "Пн",
        NNE: "Пн-Пн-Сх",
        NE: "Пн-Сх",
        ENE: "Сх-Пн-Сх",
        E: "Сх",
        ESE: "Сх-Пд-Сх",
        SE: "Пд-Сх",
        SSE: "Пд-Пд-Сх",
        S: "Пд",
        SSW: "Пд-Пд-Зх",
        SW: "Пд-Зх",
        WSW: "Зх-Пд-Зх",
        W: "Зх",
        WNW: "Зх-Пн-Зх",
        NW: "Пн-Зх",
        NNW: "Пн-Пн-Зх",
      },
    },
    coachMarks: {
      skip: "Пропустити тур",
      next: "Далі",
      finish: "Завершити",
      dismiss: "Відхилити",
      locationTitle: "Змінити локацію",
      locationData: "Ви можете обрати або змінити вашу локацію на іншу прямо тут.",
      sightingsTitle: "Наступне спостереження та зворотній відлік",
      sightingsData:
        "Цей розділ показує вам дату та відлік до наступного наближення МКС до вашої обраної локації. Ви можете натиснути на блок 'Наступне спостереження', щоб побачити повний список майбутніх спостережень.",
      globeTitle: "Інтерактивна Земля",
      globeData:
        "Ви можете переглянути розташування МКС у даний час, проводячи пальцем по екрану. Це дозволяє вам взаємодіяти з Землею та відстежувати розташування МКС в реальному часі.",
      mapTitle: "2D Вид на мапі",
      mapData:
        "Цей розділ показує 2D відображення повного шляху МКС відносно областей ночі та дня на Землі.",
      navigationTitle: "Навігація",
      navigationData:
        "Ви можете переходити між різними функціями додатка з навігаційного меню нижче.",
    },
  },
  issView: {
    timeHeader: "Зворотній відлік",
    cameraPermissionText:
      "Ви не надали дозвіл на використання камери вашого телефону. Натисніть тут, щоб надати дозвіл.",
    issCaptured: "Зафіксуйте цей момент",
    details: {
      title: "Міжнародна космічна станція - Деталі",
      orbitalSpeed: "Орбітальна швидкість",
      longitude: "Довгота",
      latitude: "Широта",
      altitude: "Висота",
      crewOnboard: "Типова чисельність екіпажу на борту",
      launched: "Початок збирання",
      launchedValue: "20 листопада 1998",
      mass: "Приблизна маса",
      dimensions: "Приблизні розміри",
      orbitalPeriod: "Період обертання навколо Землі",
      orbitsPerDay: "Обертів на день",
      dimensionsValue: "109м x 73м x 14м",
    },
  },
  settings: {
    header: "Налаштування",
    locationSettings: "Налаштування локації",
    notificationSettings: "Налаштування сповіщень",
    termsAndConditions: "Умови та положення",
    contactUs: "Зв'яжіться з нами",
    language: "Мова",
    termsAndConditionsData: {
      backButton: "Налаштування",
      ios: {
        title: "ЛІЦЕНЗІЙНА УГОДА ПРО ВИКОРИСТАННЯ ДОДАТКА",
        intro1:
          "КОРИСТУВАЧ КІНЦЕВОГО ПРИСТРОЮ бажає скористатися наступним ЛІЦЕНЗІЙНИМ ДОДАТКОМ, розробленим Урядом Сполучених Штатів Америки у виконанні Національної аеронавтичної та космічної адміністрації, розташованої за адресою: 300 E Street SW, Вашингтон, округ Колумбія (надалі – NASA):",
        appData: {
          line1: "Ліцензійний додаток:",
          line2: "Версія:",
          line3: "Номер технології NASA: MSC-27535-1 (надалі – ЛІЦЕНЗІЙНИЙ ДОДАТОК)",
        },
        contactData: {
          line1: "Контактна особа в NASA:",
          line2: "Джейкоб Кітон",
          line3: "Центральний офіс NASA",
          line4: "300 E Street SW",
          line5: "Електронна пошта: SpotTheStation@hq.nasa.gov",
        },
        intro2:
          "Правомочністю NASA для передачі ЛІЦЕНЗІЙНОГО ДОДАТКА є Директива NASA Policy Directive (NPD) 2820.1C",
        intro3:
          "ТАКИМ ЧИНОМ, з урахуванням того, що NASA надає право користування ЛІЦЕНЗІЙНИМ ДОДАТКОМ КІНЦЕВОМУ КОРИСТУВАЧУ та надає КІНЦЕВОМУ КОРИСТУВАЧУ непередаваний право на використання ЛІЦЕНЗІЙНОГО ДОДАТКА на будь-якому iPhone або iPod touch, яким володіє або керує КІНЦЕВИЙ КОРИСТУВАЧ, згідно з правилами використання, зазначеними в Умовах та положеннях App Store лише для некомерційних цілей, КІНЦЕВИЙ КОРИСТУВАЧ погоджується з наступним:",
        body: {
          line1:
            "1. NASA та КІНЦЕВИЙ КОРИСТУВАЧ погоджуються, що ця Угода укладена лише між NASA та КІНЦЕВИМ КОРИСТУВАЧЕМ, а не з Apple. Ця Угода не підлягає передачі третім особам, і NASA, а не Apple, є єдиним відповідальним за ЛІЦЕНЗІЙНИЙ ДОДАТОК та його вміст.",
          line2:
            "2. NASA та КІНЦЕВИЙ КОРИСТУВАЧ підтверджують і погоджуються з тим, що Apple, а також підрозділи Apple, є третіми бенефіціарами цієї Угоди, і що після прийняття КІНЦЕВИМ КОРИСТУВАЧЕМ умов цієї Угоди Apple матиме право (і буде вважатися таким, що прийняв право) здійснювати виконання цієї Угоди проти КІНЦЕВОГО КОРИСТУВАЧА як третього бенефіціара цієї Угоди.",
          line3:
            "3. ЛІЦЕНЗІЙНИЙ ДОДАТОК залишається власністю NASA. КІНЦЕВИЙ КОРИСТУВАЧ визнає, що він не набуває права власності на ЛІЦЕНЗІЙНИЙ ДОДАТОК за цією Угодою. ЛІЦЕНЗІЙНИЙ ДОДАТОК не знаходиться у громадському користуванні, і ніщо в цій Угоді не тлумачиться як надання ЛІЦЕНЗІЙНОГО ДОДАТКА громадському з користуванням без обмежень.",
          line4:
            "4. КІНЦЕВИЙ КОРИСТУВАЧ не має права випуску, розповсюдження або публікації ЛІЦЕНЗІЙНОГО ДОДАТКА.",
          line5:
            "5. NASA не несе відповідальності за обслуговування або оновлення наданого ЛІЦЕНЗІЙНОГО ДОДАТКА та виправлення будь-яких помилок у ЛІЦЕНЗІЙНОМУ ДОДАТКУ. КІНЦЕВИЙ КОРИСТУВАЧ погоджується з тим, що Apple не має жодних зобов'язань щодо надання будь-яких послуг з обслуговування та підтримки щодо ЛІЦЕНЗІЙНОГО ДОДАТКА.",
          line6:
            "6. КІНЦЕВИЙ КОРИСТУВАЧ заявляє і гарантує, що (i) він/вона не знаходиться в країні, що перебуває під ембарго уряду США, або яку уряд США визнав «країною, що підтримує тероризм»; та (ii) він/вона не включений(-а) до жодного списку заборонених або обмежених осіб уряду США.",
          line7:
            "7. ЛІЦЕНЗІЙНИЙ ДОДАТОК НАДАЄТЬСЯ «ТАКИМ, ЯК ВІН Є» БЕЗ БУДЬ-ЯКИХ ГАРАНТІЙ БУДЬ-ЯКОГО ВИДУ, ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЬ, БУДЬ-ЯКИХ ГАРАНТІЙ ВІДПОВІДНОСТІ ЛІЦЕНЗІЙНОГО ДОДАТКА СПЕЦИФІКАЦІЯМ, БУДЬ-ЯКИХ УМОВНИХ ГАРАНТІЙ ТОРГОВОЇ ПРИДАТНОСТІ, ВІДПОВІДНОСТІ ДЛЯ ПЕВНОЇ МЕТИ ТА ВІДСУТНОСТІ ПОРУШЕННЯ ПРАВ, АБО БУДЬ-ЯКИХ ІНШИХ ГАРАНТІЙ. В УМОВАХ ЦІЄЇ УГОДИ NASA НЕ ВІДПОВІДАЄ ЗА ЖОДНІ ЗБИТКИ, ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЬ, ПРЯМІ, НЕПРЯМІ, ОСОБЛИВІ АБО ПОСЕРЕДНІ ЗБИТКИ, ЩО ВИНИКАЮТЬ З ВИКОРИСТАННЯ ЛІЦЕНЗІЙНОГО ДОДАТКА, НЕЗАЛЕЖНО ВІД ТОГО, ЧИ ТАКІ ЗБИТКИ ВИНИКЛИ НА ПІДСТАВІ ГАРАНТІЙНОЇ, КОНТРАКТНОЇ, ДЕЛІКТНОЇ ЧИ ІНШОЇ ОСНОВИ, НЕЗАЛЕЖНО ВІД ТОГО, ЧИ БУЛИ ЗБИТКИ ЗАВДАНІ ОСОБАМ АБО МАЙНУ АБО ЧИ БУЛИ ЗБИТКИ ЗАВДАНІ ВНАСЛІДОК ВИКОРИСТАННЯ ЛІЦЕНЗІЙНОГО ДОДАТКА. КІНЦЕВИЙ КОРИСТУВАЧ ПОГОДЖУЄТЬСЯ З ВІДМОВОЮ ВІД БУДЬ-ЯКИХ ВИМОГ ПРОТИ УРЯДУ США, ЙОГО ПІДПРИЄМЦІВ ТА ПІДПІДРЯДНИХ ОБ'ЄКТІВ, А ТАКОЖ ЗОБОВ'ЯЗУЄТЬСЯ ВІДШКОДУВАТИ ЗБИТКИ ТА ЗВІЛЬНИТИ ВІД ВІДПОВІДАЛЬНОСТІ УРЯД США, ЙОГО ПІДПРИЄМЦІВ ТА ПІДПІДРЯДНИХ ОБ'ЄКТІВ ВІД БУДЬ-ЯКИХ ЗБИТКІВ, ЩО ЧЕРЕЗ ВИКОРИСТАННЯ КІНЦЕВИМ КОРИСТУВАЧЕМ ЛІЦЕНЗІЙНОГО ДОДАТКА, ВКЛЮЧАЮЧИ БУДЬ-ЯКІ ЗБИТКИ ВІД ТОВАРІВ НА ОСНОВІ ЧИ В РЕЗУЛЬТАТІ ВИКОРИСТАННЯ ЛІЦЕНЗІЙНОГО ДОДАТКА.",
          line8:
            "8. У разі виявлення будь-яких невідповідностей ЛІЦЕНЗІЙНОГО ДОДАТКА будь-яким гарантійним умовам, встановленим законом, КІНЦЕВИЙ КОРИСТУВАЧ може повідомити Apple, і Apple поверне КІНЦЕВОМУ КОРИСТУВАЧУ вартість придбання (за наявності) ЛІЦЕНЗІЙНОГО ДОДАТКА. В максимально можливому обсязі, що дозволяє законодавство, Apple не несе відповідальності за будь-які інші збитки, зобов'язаності, пошкодження, затрати і витрати, що виникли в результаті будь-якої невідповідності ЛІЦЕНЗІЙНОГО ДОДАТКА будь-яким гарантійним умовам.",
          line9:
            "9. NASA та КІНЦЕВИЙ КОРИСТУВАЧ погоджуються з тим, що, в разі будь-яких претензій сторонніх осіб щодо того, що ЛІЦЕНЗІЙНИЙ ДОДАТОК або володіння та використання ЛІЦЕНЗІЙНОГО ДОДАТКА КІНЦЕВИМ КОРИСТУВАЧЕМ порушує права інтелектуальної власності, NASA, а не Apple, буде виключно відповідальною за розслідування, захист, урегулювання та розв'язання будь-яких таких претензій щодо порушення прав інтелектуальної власності, згідно з законодавством.",
          line10:
            "10. NASA та КІНЦЕВИЙ КОРИСТУВАЧ погоджуються з тим, що NASA, а не Apple, відповідальна за розгляд будь-яких претензій КІНЦЕВОГО КОРИСТУВАЧА або сторонньої особи, пов'язаних з ЛІЦЕНЗІЙНИМ ДОДАТКОМ або володінням та/або використанням ЛІЦЕНЗІЙНОГО ДОДАТКА, включаючи, але не обмежуючись: (i) претензії про відповідальність за якість продукту; (ii) будь-які претензії про те, що ЛІЦЕНЗІЙНИЙ ДОДАТОК не відповідає будь-яким чинним законодавчим або нормативним вимогам, включаючи будь-які гарантійні умови, встановлені законодавством; і (iii) претензії, що виникають на підставі законодавства про захист прав споживачів чи подібних законів.",
          line11:
            "11. Дана Угода буде тлумачитись і юридичні відносини між сторонами будуть визначені відповідно до федерального законодавства США для всіх цілей.",
          line12:
            "12. Дана Угода являє собою повну згоду і домовленість між NASA та КІНЦЕВИМ КОРИСТУВАЧЕМ щодо релізу ЛІЦЕНЗІЙНОГО ДОДАТКА і не може бути змінена або поправлена.",
          line13:
            "13. Приймаючи та використовуючи ЛІЦЕНЗІЙНИЙ ДОДАТОК на підставі цієї Угоди, КІНЦЕВИЙ КОРИСТУВАЧ згоден з усіма умовами та положеннями, що вказані тут.",
        },
      },
      android: {
        title: "ЛІЦЕНЗІЙНА УГОДА ЩОДО ВИКОРИСТАННЯ ЛІЦЕНЗІЙНОГО ДОДАТКА",
        intro1:
          "КІНЦЕВИЙ КОРИСТУВАЧ бажає використовувати наступний ПРОДУКТ, розроблений урядом Сполучених Штатів Америки в особі Національного аеронавтичного та космічного агентства, Центр дослідження Еймса, розташованого в Моффетт Філд, CA 94035 (далі - NASA):",
        appData: {
          line1: "Програмний продукт:",
          line2: "Версія:",
          line3: "Номер технології NASA: MSC-27535-1",
        },
        intro2:
          "Підставою для NASA надання ЛІЦЕНЗІЙНОГО ДОДАТКА є Директива НАСА з політики NPD 2820.1C.",
        intro3:
          "ТАКИМ ЧИНОМ, на умовах, що NASA надає КІНЦЕВОМУ КОРИСТУВАЧУ ЛІЦЕНЗІЙНИЙ ДОДАТОК та надає КІНЦЕВОМУ КОРИСТУВАЧУ непередавальне право використовувати ЛІЦЕНЗІЙНИЙ ДОДАТОК виключно для особистих, некомерційних цілей та згідно з умовами та положеннями Термінів користування Android Market на будь-якому мобільному пристрої на базі Android (“Пристрій”), який належить або перебуває під контролем КІНЦЕВОГО КОРИСТУВАЧА, КІНЦЕВИЙ КОРИСТУВАЧ зобов'язується дотримуватися таких умов:",
        body: {
          line1:
            "1. ЛІЦЕНЗІЙНИЙ ДОДАТОК залишається власністю NASA. КІНЦЕВИЙ КОРИСТУВАЧ визнає, що він не набуває права власності на ЛІЦЕНЗІЙНИЙ ДОДАТОК в рамках цієї Угоди. ЛІЦЕНЗІЙНИЙ ДОДАТОК не є загальнодоступним, і ніщо в цій Угоді не повинно розумітися як надання загальнодоступного доступу до ЛІЦЕНЗІЙНОГО ДОДАТКА.",
          line2:
            "2. КІНЦЕВИЙ КОРИСТУВАЧ не має права розповсюджувати, поширювати або публікувати ЛІЦЕНЗІЙНИЙ ДОДАТОК.",
          line3:
            "3. NASA не несе відповідальності за обслуговування та оновлення наданого ЛІЦЕНЗІЙНОГО ДОДАТКА, а також за виправлення помилок у ЛІЦЕНЗІЙНОМУ ДОДАТКУ.",
          line4:
            '4. КІНЦЕВИЙ КОРИСТУВАЧ заявляє та гарантує, що (i) він не знаходиться в країні, яка перебуває під ембарго уряду США або яка була визнана урядом США "терористичною країною, що підтримує тероризм"; (ii) він не включений до списку заборонених або обмежених сторон уряду США.',
          line5:
            "5. ЛІЦЕНЗІЙНИЙ ДОДАТОК НАДАЄТЬСЯ «ЯК Є» БЕЗ ЖОДНОЇ ГАРАНТІЇ, ВИРАЖЕНОЇ, ПРЯМОЇ АБО ЗАКОННОЇ, ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЬ, БУДЬ-ЯКОЇ ГАРАНТІЇ ЩОДО ВІДПОВІДНОСТІ ЛІЦЕНЗІЙНОГО ДОДАТКА СПЕЦИФІКАЦІЯМ, БУДЬ-ЯКИХ ПІДТИВЕННИХ ГАРАНТІЙ ТОРГОВЕЛЬНОЇ ПРИДАТНОСТІ, ПРИДАТНОСТІ ДЛЯ ПЕВНИХ ЦІЛЕЙ ТА ВІДСУТНОСТІ ПОРУШЕНЬ ПРАВА, АБО БУДЬ-ЯКОЇ ГАРАНТІЇ ЩОДО ТОГО, ЩО ЛІЦЕНЗІЙНИЙ ДОДАТОК БУДЕ ПРАЦЮВАТИ БЕЗ ПОМИЛОК. В ЖОДНОМУ РАЗІ NASA НЕ НЕСЕ ВІДПОВІДАЛЬНОСТІ ЗА БУДЬ-ЯКІ ЗБИТКИ, ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЬ, ПРЯМІ, НЕПРЯМІ, СПЕЦІАЛЬНІ АБО ПОСЕРЕДНІ ЗБИТКИ, ЩО ВИНИКАЮТЬ ВНАСЛІДОК ВИКОРИСТАННЯ ЛІЦЕНЗІЙНОГО ДОДАТКА, НЕЗАЛЕЖНО ВІД ПІДСТАВИ ВІДПОВІДАЛЬНОСТІ, КОНТРАКТУ, НЕОБЕРЕЖНОСТІ ЧИ ІНШИХ ОБСТАВИН, І ЧИ БУЛИ ЗБИТКИ СПРИЧИНЕНІ ОСОБАМИ АБО МАЙНОМ, І ЧИ ВИНИКЛИ ЗБИТКИ З ВИКОРИСТАННЯ ЛІЦЕНЗІЙНОГО ДОДАТКА ЧИ НІ. КІНЦЕВИЙ КОРИСТУВАЧ ПОГОДЖУЄТЬСЯ ВІДМОВИТИСЯ ВІД БУДЬ-ЯКИХ ПРЕТЕНЗІЙ ПРОТИ УРЯДУ США, ЙОГО ПІДПРИЄМЦІВ ТА ПІДПІДРЯДНИХ ПІДПРИЄМСТВ І ГАРАНТУВАТИ І ЗАХИЩАТИ УРЯД США, ЙОГО ПІДПРИЄМЦІВ ТА ПІДПІДРЯДНИХ ПІДПРИЄМСТВ ВІД БУДЬ-ЯКИХ ЗБИТКІВ, ЯКІ МОЖЕ СТВОРИТИ КІНЦЕВИЙ КОРИСТУВАЧ З ВИКОРИСТАННЯ ЛІЦЕНЗІЙНОГО ДОДАТКА, ВКЛЮЧАЮЧИ БУДЬ-ЯКІ ЗБИТКИ ВІД ЛІЦЕНЗІЙНИХ ДОДАТКІВ, ЗАСНОВАНИХ НА ЛІЦЕНЗІЙНОМУ ДОДАТКУ АБО ВИНИКЛИХ ІЗ ЗАСТОСУВАННЯ ЛІЦЕНЗІЙНОГО ДОДАТКА.",
          line6:
            "6. Дана Угода буде тлумачитися і встановлюватися відповідно до федерального законодавства Сполучених Штатів Америки для всіх цілей.",
          line7:
            "7. Дана Угода становить повне розуміння та згоду між NASA та КІНЦЕВИМ КОРИСТУВАЧЕМ щодо надання ЛІЦЕНЗІЙНОГО ДОДАТКА та не може бути замінена, змінена або доповнена.",
          line8:
            "8. Приймаючи та використовуючи ЛІЦЕНЗІЙНИЙ ДОДАТОК згідно з даною Угодою, КІНЦЕВИЙ КОРИСТУВАЧ згоден з усіма правилами та умовами даної Угоди.",
        },
      },
    },
    contactUsData: {
      backButton: "Налаштування",
      title: "Зв'яжіться з нами",
      titlePlaceholder: "Оберіть тему",
      commentsPlaceholder: "Введіть коментар",
      sendButton: "Відправити",
      contactUsOptions: {
        reportAnIssue: "Повідомити про проблему",
        improvementIdeas: "Ідеї щодо покращення",
        generalQuestions: "Загальні питання",
        comments: "Коментарі",
      },
    },
    notificationSettingsData: {
      backButton: "Налаштування",
      notificationTitle: "Налаштування сповіщень",
      privacyTitle: "Налаштування конфіденційності",
      upcomingLabel: "Майбутні події",
      customizeLabel: "Налаштувати індивідуальні сповіщення",
      upcomingTip: "Вимкніть, щоб припинити отримання сповіщень про події.",
      notifyMeBefore: "СПОВІСТИТИ МЕНЕ ЗА",
      turnOffNotifications: "ВИМКНУТИ СПОВІЩЕННЯ",
      from: "З",
      until: "До",
    },
    locationSettingsData: {
      backToSettings: "Налаштування",
      goBack: "Повернутися",
      generalTitle: "Налаштування локації",
      cta: "Налаштувати сповіщення для цієї локації",
      locationPermission: "Надати дозвіл на доступ до локації",
      addNewLocation: {
        generalTitleAdd: "Додати нову локацію",
        generalTitleEdit: "Редагувати локацію",
        confirnModalButton: "Підтвердити",
        saveButton: "Зберегти локацію",
        searchInputPlaceholder: "Введіть місто, поштовий індекс або адресу",
        nameInputPlaceholder: "Назва локації",
      },
      removeLocation: {
        question: "Ви впевнені, що хочете видалити цю локацію?",
        cancelButton: "Скасувати",
        removeButton: "Видалити",
      },
    },
    localCalculations: "Локальні обчислення",
  },
  resources: {
    header: "Ресурси",
    searchPlaceholder: "Пошук статей, подій, тощо...",
    suggestions: "ПРОПОЗИЦІЇ",
    searchResults: "Результати пошуку",
    tabs: {
      news: "Новини",
      about: "Про МКС",
      details: "Деталі",
    },
  },
}

export default uk
export type Translations = typeof uk
